# RecursionParameterIgnored Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..RecursionParameterIgnored Property
BuiltInFailures..::..WallFailures Class See Also
---
Parameter-defined type of curtain panels defined in a circular way and will be ignored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RecursionParameterIgnored { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RecursionParameterIgnored As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RecursionParameterIgnored {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace